from tkinter import *
import random

w = [('Александра'),('Алена'),('Алина'),('Алиса'),('Алла'),('Анастасия'),('Ангелина'),('Анна'),('Антонина'),('Арина'),('Валентина'),('Валерия'),('Варвара'),('Василиса'),('Вера'),
('Вероника'),('Виктория'),('Галина'),('Дарья'),('Ева'),('Евгения'),('Евдокия'),('Екатерина'),('Елена'),('Елизавета'),('Жанна'),('Зинаида'),('Злата'),('Зоя'),('Иванна'),('Ирина'),
('Ия'),('Кира'),('Кристина'),('Ксения'),('Лидия'),('Любовь'),('Людмила'),('Маргарита'),('Марина'),('Мария'),('Милана'),('Надежда'),('Наталья'),('Нина'),('Ольга'),('Полина'),
('Раиса'),('Светлана'),('София'),('Таисия'),('Тамара'),('Татьяна'),('Ульяна'),('Юлия'),('Яна')]

m = [('Александр'),('Алексей'),('Анатолий'),('Андрей'),('Антон'),('Аркадий'),('Арсений'),('Артем'),('Богдан'),('Борис'),('Вадим'),('Валентин'),('Валерий'),('Василий'),
('Виктор'),('Виталий'),('Владимир'),('Владислав'),('Вячеслав'),('Геннадий'),('Георгий'),('Глеб'),('Григорий'),('Даниил'),('Денис'),('Дмитрий'),('Евгений'),('Егор'),('Иван'),
('Игорь'),('Илья'),('Кирилл'),('Константин'),('Леонид'), ('Макар'),('Максим'),('Марк'),('Матвей'),('Михаил'),('Никита'),('Николай'),('Олег'),('Павел'),('Петр'),('Роман'),
('Руслан'),('Святослав'),('Семен'),('Сергей'),('Станислав'),('Степан'),('Тимофей'), ('Федор'),('Юрий'),('Ярослав'),('Ян')]

lw = len(w)
lm = len(m)

def fun_tx():
    x = y.get()

    if x == '1':
        z = random.randrange(0, lm)
        tx.config(text='Мужское имя : ' + m[z])
    elif x == '2':
        z = random.randrange(0, lw)
        tx.config(text='Женское имя : ' + w[z])
    else:
        tx.config(text='Ошиблись'+ '\n' + 'можете попробовать еще')
    return

a = Tk()
y = StringVar()

a.geometry('350x250+500+300')
a.title('Генератор имен 1.1')

tx = Label(a, text='Введите 1 - для мужского' + '\n' + 'и 2 - для женского имени' + '\n').pack()
b = Button(a, text = '\n' + 'Генерировать' + '\n', command = fun_tx, fg ='#000', bg='#34A2FE').pack()

tx = Label(a)
tx.pack(padx=22, pady=22)

e = Entry(a,textvariable=y).pack()
a.mainloop()





