from tkinter import *
import random

code_list1 = [('Александра'),('Алена'),('Алина'),('Алиса'),('Алла'),('Анастасия'),('Ангелина'),('Анна'),('Антонина'),('Арина'),('Валентина'),('Валерия'),('Варвара'),('Василиса'),('Вера'),
('Вероника'),('Виктория'),('Галина'),('Дарья'),('Ева'),('Евгения'),('Евдокия'),('Екатерина'),('Елена'),('Елизавета'),('Жанна'),('Зинаида'),('Злата'),('Зоя'),('Иванна'),('Ирина'),
('Ия'),('Кира'),('Кристина'),('Ксения'),('Лидия'),('Любовь'),('Людмила'),('Маргарита'),('Марина'),('Мария'),('Милана'),('Надежда'),('Наталья'),('Нина'),('Ольга'),('Полина'),
('Раиса'),('Светлана'),('София'),('Таисия'),('Тамара'),('Татьяна'),('Ульяна'),('Юлия'),('Яна')]

code_list2 = ['Александр', 'Алексей', 'Анатолий', 'Андрей', 'Антон', 'Аркадий', 'Арсений', 'Артем', 'Богдан', 'Борис', 'Вадим', 'Валентин', 'Валерий', 'Василий', 'Виктор', 'Виталий', 'Владимир',
'Владислав', 'Вячеслав', 'Геннадий', 'Георгий', 'Глеб', 'Григорий', 'Даниил', 'Денис', 'Дмитрий', 'Евгений', 'Егор', 'Иван', 'Игорь', 'Илья', 'Кирилл', 'Константин', 'Леонид',
'Макар', 'Максим', 'Марк', 'Матвей', 'Михаил', 'Никита', 'Николай', 'Олег', 'Павел', 'Петр', 'Роман', 'Руслан', 'Святослав', 'Семен', 'Сергей', 'Станислав', 'Степан', 'Тимофей',
'Федор', 'Юрий', 'Ярослав',('Ян')]

length_code_list1 = len(code_list1)
length_code_list2 = len(code_list2)

def mhello():
    mtext = ment.get()

    if mtext == '1':
        number = random.randrange(0, length_code_list2)
        mlabe12.config(text='Мужское имя : ' + code_list2[number])
    elif mtext == '2':
        number = random.randrange(0, length_code_list1)
        mlabe12.config(text='Женское имя : ' + code_list1[number])
    else:
        mlabe12.config(text='Сгенерировано'+ '\n' + 'можете попробовать еще')
    return

mGui = Tk()
ment = StringVar()

mGui.geometry('350x250+500+300')
mGui.title('Генератор имен 1.1')

mlabel = Label(mGui, text='Введите 1 - для мужского' + '\n' + 'и 2 - для женского имени' + '\n').pack()
mbutton = Button(mGui, text = '\n' + 'Генерировать' + '\n', command = mhello, fg ='#000', bg='#34A2FE').pack()

mlabe12 = Label(mGui)
mlabe12.pack(padx=22, pady=22)

mEntry = Entry(mGui,textvariable=ment).pack()
mGui.mainloop()
